Repository: oliverthiele/ot-btcarousel
Catalog: Resources/Private/Language/*.locallang_*.xlf
Languages: de

# extension.title
source: BT Carousel
de: BT Karussell

# extension.description
source: Content Element for Bootstrap Carousels
de: Inhaltselement für Bootstrap Karussells

# sys_file_reference.link.description
source: The title of the link overwrites the button label set by default in the slider.
de: Der Titel des Links überschreibt die standardmäßig gesetzte Button-Beschriftung im Slider.

# flexform.interval.label
source: Interval
de: Intervall

# flexform.fade.label
source: Use Crossfade
de: Benutze Überblendung

# flexform.fade.description
source: Animate slides with a fade transition instead of a slide.
de: Slides überblenden anstatt verschieben.

# flexform.darkVariant.label
source: Dark Variant
de: Dunkle Variante

# flexform.disableControls.label
source: Disable Controls
de: Deaktiviere Kontroll-Icons

# flexform.disableIndicators.label
source: Disable Indicators
de: Deaktiviere Indikatoren

# flexform.keyboard.label
source: React to keyboard events
de: Reagieren auf Tastaturereignisse

# flexform.pause.label
source: Pause while hover
de: Pause bei Mouseover

# flexform.pause.description
source: If set, pauses the cycling of the carousel on mouseenter and resumes the cycling of the carousel on mouseleave. If set to false, hovering over the carousel won't pause it.
de: Wenn diese Option gesetzt ist, wird das Karussell beim Betreten mit der Maus angehalten und beim Verlassen mit der Maus wieder fortgesetzt. Wenn er auf false gesetzt ist, wird das Karussell nicht angehalten, wenn Sie mit der Maus darüber fahren.

# flexform.ride.label
source: Autoplay the carousel on load
de: Autoplay des Karussells beim Laden

# flexform.ride.description
source: Autoplays the carousel after the user manually cycles the first item. If set to true, autoplays the carousel on load.
de: Zeigt das Karussell automatisch an, nachdem der Benutzer das erste Element manuell gewechselt hat. Wenn auf true gesetzt, wird das Karussell beim Laden automatisch angezeigt.

# flexform.wrap.label
source: Endless run
de: Endloser Durchlauf

# flexform.wrap.label
source: Stop after the first run?
de: Nach dem ersten Durchlauf stoppen?

# flexform.touch.label
source: Enable support for touchscreen devices
de: Unterstützung für Touchscreen-Geräten aktivieren

# flexform.touch.description
source: Sets whether the carousel should support left/right swipe interactions on touchscreen devices.
de: Legt fest, ob das Karussell Links/Rechts-Swipe-Interaktionen auf Touchscreen-Geräten unterstützen soll.
